{
    "title": "Educational Game Design",
    "description": "AP CSA Sep 9th - Sep 22nd, 2019",
    "date": "September 9th - September 22nd, 2019",
    "class": "AP CSA (Computer Science Applications)",
    "imgType": "png",
    "content": "The Educational Game Design project was an assignment in my AP Computer Science Applications class where the objective was to take an existing game developed in Greenfoot and modify it to make it educational. My team took a game called Pig Hunter where you shoot pigs and earn points and turned it into what we call Word Hunter. Every time the player shot a pig, a word would be displayed on their screen. The word would be read out and a definition would be provided. This game would help young children and non-native English speakers with learning words and how to pronounce them. The player has to retype the word to move on. My role in this project was developing a way to interface with an external dictionary API and utilize Google’s Text to Speech library within Greenfoot. This would allow us to pull random words and their definitions from the dictionary that would be displayed within the game and spoken by the computer. The problem was, Greenfoot’s library support is very limited. Greenfoot allows libraries to be imported within the user’s preferences however that means that every single user who downloaded the game would have to set up their preferences to import the libraries otherwise it wouldn’t compile. This does not allow for ease of use. The workaround I came up with was to utilize a class that could load native libraries. The libraries are packaged as jars within the repository and our code points to their relative path and loads them through the functions in this class. You can view the <a href=\"https://docs.google.com/document/d/1rxJuo6uBlPLQ7kgPixntjIxa7H0U6nySGBfMqeL96A0/edit?usp=sharing\" class=\"link\" target=\"_blank\" rel=\"noopener noreferrer\">documentation</a> and <a href=\"https://docs.google.com/presentation/d/1TD9ZSYptOxDn8DlLta4jBdJhisXiU7Y_0MbqQOyrrU8/edit?usp=sharing\" class=\"link\" target=\"_blank\" rel=\"noopener noreferrer\">slides</a> for more information."
  }