{
  "title": "Magpie",
  "description": "AP CSA Nov 4th - Nov 12th, 2019",
  "date": "November 4th - November 12th, 2019",
  "class": "AP CSA (Computer Science Applications)",
  "imgType": "jpg",
  "content": "This project was completed in my AP Computer Science Applications class. For this project, the objective was to create a functional chatbot that was as realistic as you could make it. It also had to be unique from the rest of the class in some way and be focused on a certain topic or have a certain personality. My group of three created a chatbot that mimics the speech pattern of Yoda from Star Wars. Yoda has a very unique speech pattern and we thought it would be entertaining to try and mimic that. We had a given set of requirements that we had to carry over from our template chatbot we had been developing the past few days. These included simple questions such as “How many brothers do you have?” if the user mentions their siblings. In addition we had to add many more phrases that could be recognized and appropriate reactions by recognizing certain terms in the input. To extend further on the project, I decided to incorporate the natural language processing library wit.ai. Wit.ai is able to take an input and identify the intent of it as well as other traits by training it. For this chatbot, I trained wit.ai to be able to recognize compliments. I train the bot by manually entering phrases such as “you are nice”, “you are kind”, and “how thoughtful of you” so that eventually the bot was able to recognize different phrases that were also compliments. I did this for a variety of different intents such as compliments and insults. The Java code makes a GET request to the API when no other response in the code fits and the JSON object returned tells the code the intent of the user’s input. From there, a fitting response is chosen using a switch statement. You can view the <a href=\"https://docs.google.com/document/d/1HeAVF-roVqSm-oUJYFKFya0-TEg_9Qk6Y3QBJNZg6l0/edit?usp=sharing\" class=\"link\" target=\"_blank\" rel=\"noopener noreferrer\">documentation</a> and the <a href=\"https://docs.google.com/presentation/d/1rwXp5JS_tHUfJuajA7QJ8yaFisVvuc-DzAqmZ4_4MHM/edit?usp=sharing\" class=\"link\" target=\"_blank\" rel=\"noopener noreferrer\">slides</a> for more information."
}